In [1]:
import pandas
import numpy

In [2]:
numpy.random.randint(1,100,5)

array([ 5, 34, 11, 28, 42])

In [3]:
dataframe = pandas.DataFrame({'Names' : ['Tejas','Aditya','Sarthak','Prathamesh','Danny'] , 
                              'PRN' : [37,21,28,11,42] ,
                              'Marks' : numpy.random.randint(1,100,5)   
                             })

In [4]:
dataframe.loc[4,'Marks'] = numpy.nan

In [5]:
dataframe

        Names  PRN  Marks
0       Tejas   37   74.0
1      Aditya   21    8.0
2     Sarthak   28   20.0
3  Prathamesh   11   56.0
4       Danny   42    NaN

In [6]:
dataframe.fillna({'Marks' : "Not Calculated"})

        Names  PRN           Marks
0       Tejas   37              74
1      Aditya   21               8
2     Sarthak   28              20
3  Prathamesh   11              56
4       Danny   42  Not Calculated

In [7]:
dataframe = {}

In [8]:
dataframe['Test_type'] = pandas.DataFrame(columns = ['CT1' , 'CT2' , 'Viva'] ,
                                         data = [numpy.random.randint(0,100,3).tolist() , numpy.random.randint(0,100,3).tolist() , numpy.random.randint(0,100,3).tolist()])

In [9]:
dataframe['Max_Marks'] = pandas.DataFrame(columns = ['CT1Max' , 'CT2Max' , 'VivaMax'] ,
                                         data = [numpy.repeat(100,3).tolist()])

In [10]:
dataframe = pandas.concat(dataframe , axis = 1)

In [11]:
dataframe['PRN'] = numpy.random.randint(1,80,3)

In [12]:
dataframe = dataframe.fillna(100)

In [13]:
dataframe = dataframe.set_index('PRN')

In [14]:
dataframe

    Max_Marks                Test_type
       CT1Max CT2Max VivaMax       CT1 CT2 Viva
PRN
35      100.0  100.0   100.0         1  79   34
61      100.0  100.0   100.0        99  76   47
76      100.0  100.0   100.0        38   3   14

In [152]:
dataframe

    Max_Marks                Test_type          Percentage
       CT1Max CT2Max VivaMax       CT1 CT2 Viva
PRN
69      100.0  100.0   100.0        79  46   53  59.333333
56      100.0  100.0   100.0        60  78   64  67.333333
30      100.0  100.0   100.0        85  67   74  75.333333